In [ ]:
FUNCTIONAL DEPENDENCY:
    
--->Trivial Vs Non Trivial Functional Dependency  

Trivial----> If a functional dependency (FD) X → Y holds,
where Y is a subset of X, then it is called a trivial FD. 
Trivial FDs always hold. 

AB---->A

Non-trivial---->If an FD X → Y holds, 
where Y is not a subset of X, 
then it is called a non-trivial FD.

AB--->ABC

In [ ]:
TABLE-1

A    B     C     D
1    a     x
2    b     y
3    b     x
4    c     y

In [ ]:
SUPER KEY: The set of attributes which can uniquely identify a tuple is known as Super Key.
   
A---->BC
BC--->A  
#Both are super key or key.

In [ ]:
CANDIDATE KEY: The minimal set of attribute which can uniquely identify a tuple is known
as candidate key.

R(ABCD)

           SUPER KEY     CANDIDATE KEY
A-->BCD     YES            YES
AB-->CD     YES            NO
ABC-->D     YES            NO
BD--->AB    YES            YES #Is SINGLE B IS SUPER KEY-->NO,IS SINGLE D IS SUPER KEY-->NO SO IT IS CANDIDATE KEY.
C--->AD     YES            NO

In [ ]:
PRIMARY KEY: There can be more than one candidate key in a relation out of which one can be
chosen as primary key.

-->IN R(ABCD) There are two candidate key but data base administration can chose only one candidate key that 
is primary key.

In [ ]:
FOREIGN KEY: A foreign key are attributes in a table, whose values match as a primary key in another table.
    
When we take primary key attributes from 2 table, it will become foreign key for 1 table.

In [ ]:
NORMALIZATION:
    
It is the process of organising data into a database to avoid :-

1.Redundancy
Redundancy in relation may cause :-
a.Insertion Anamoly
b.Updation Anamoly
c.Deletion Anamoly

In [ ]:
          STUDENT INFO
    S_ID    NAME      AGE        BRANCH   HOD_NAME
    1        A        18          CS      XYZ
    2        B        19          CS      XYZ
    3        C        18          CS      XYZ
    4        D        18          ME      PQR
    5        E        18          EC      ABC
    6        F        18          CS      XYZ

In [ ]:
1.Redundancy: When same data stored multiple times unnercessarily in database.
    suppose in branch cs is repeated three times.
    
Redundancy in relation may cause:- 

a.Insertion Anamoly: When certain data (attributes) cannot be inserted into database, without the presence of other
    data. suppose we want to insert data in branch but we cannot insert data into branch because its depend on
    s_id(student enrolled) if there present s_id then we can insert data in Branch.

b.Deletion Anamoly: If we delete some data(wanted) it cause deletion of some other data(wanted).
    
c.Updation Anamoly:When we want to change single piece of data but its must be done in all copies data.
    Suppose we only want to change HOD_NAME of s_id 1 but it can change s_id 2,3,6 also.

# 1 NF

In [ ]:
### Each coloum must have a single attribute.

id   item   colour
1     A      Green, Blue, Red
2     B      Pink, Orange

## Not in 1 NF. Colour column has multiple attribute.

In [ ]:
id   item   colour
1     A      Green
1     A      Blue
1     A      Red
2     B      Pink
2     B      Orange

# 2 NF

A relation in a Relational Database is always and at least in 1NF form.

In [ ]:
Rest in copy.

# WHERE Clause

In [ ]:
The WHERE clause is used to filter records.

The WHERE clause is used to extract only those records that fulfill a specified condition.

NOTE: The WHERE clause is not only used in SELECT statement, it is also used in UPDATE, DELETE statement, etc.!
    
SELECT column1, column2, ...
FROM table_name
WHERE condition;

SELECT * FROM Customers
WHERE Country='Mexico';

# ORDER BY Keyword

In [ ]:
The ORDER BY keyword is used to sort the result-set in ascending or descending order.

The ORDER BY keyword sorts the records in ascending order by default. To sort the records
in descending order, use the DESC keyword.

ORDER BY Syntax:
    
SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;

SELECT * FROM Customers
ORDER BY Country;

SELECT * FROM Customers
ORDER BY Country DESC;

# GROUP BY Statement

In [ ]:
The GROUP BY statement is often used with aggregate functions (COUNT, MAX, MIN, SUM, AVG) to group 
the result-set by one or more columns.

Important Points:

GROUP BY clause is used with the SELECT statement.
In the query, GROUP BY clause is placed after the WHERE clause.
In the query, GROUP BY clause is placed before ORDER BY clause if used any.


GROUP BY Syntax:
    
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s);

The following SQL statement lists the number of customers in each country:

Example
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country;

The following SQL statement lists the number of customers in each country, sorted high to low:

Example
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC;

# HAVING Clause

In [ ]:
We know that WHERE clause is used to place conditions on columns but what if we want to place conditions on groups?

This is where HAVING clause comes into use. We can use HAVING clause to place conditions to decide which group 
will be the part of final result-set. Also we can not use the aggregate functions like SUM(), COUNT() etc 
with WHERE clause. So we have to use HAVING clause if we want to use any of these functions in the conditions.

Syntax:

SELECT column1, function_name(column2)
FROM table_name
WHERE condition
GROUP BY column1, column2
HAVING condition
ORDER BY column1, column2;

function_name: Name of the function used for example, SUM() , AVG().
table_name: Name of the table.
condition: Condition used.
   
Example:

SELECT NAME, SUM(SALARY) FROM Employee 
GROUP BY NAME
HAVING SUM(SALARY)>3000;

# JOIN

In [ ]:
A SQL Join statement is used to combine data or rows from two or more tables based on a common
field between them.
Different types of Joins are:

INNER JOIN
LEFT JOIN
RIGHT JOIN
FULL JOIN

         Student
    
ROLL_NO     NAME      ADDRESS  
1           RAM         BIHAR
2           SHYAM       DELHI
3           HARI        BIHAR
4           JOHN        UP
5           MAC         KOLKATA
6           BOB         MUMBAI
7           LUSE        PATNA
      StudentCourse
    
COURSE_ID        ROLL_NO
102               1
123               2
456               3
234               4
987               5
143               6
104               9

# INNER JOIN:

INNER JOIN: The INNER JOIN keyword selects all rows from both the tables as long as the condition satisfies.
This keyword will create the result-set by combining all rows from both the tables
where the condition satisfies i.e value of the common field will be same.

Syntax:
    
SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
INNER JOIN table2
ON table1.matching_column = table2.matching_column;


table1: First table.
table2: Second table
matching_column: Column common to both the tables.
Note: We can also write JOIN instead of INNER JOIN. JOIN is same as INNER JOIN.

SELECT StudentCourse.COURSE_ID, Student.NAME FROM Student
INNER JOIN StudentCourse
ON Student.ROLL_NO = StudentCourse.ROLL_NO;

# LEFT JOIN: 

This join returns all the rows of the table on the left side of the join and matching rows for the table on the right side of join. The rows for which there is no matching row on right side, the result-set will contain null. LEFT JOIN is also known as LEFT OUTER JOIN.

Syntax:

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
LEFT JOIN table2
ON table1.matching_column = table2.matching_column;


table1: First table.
table2: Second table
matching_column: Column common to both the tables.



SELECT Student.NAME,StudentCourse.COURSE_ID 
FROM Student
LEFT JOIN StudentCourse 
ON StudentCourse.ROLL_NO = Student.ROLL_NO;
 
   OUTPUT

NAME        COURSE_ID
RAM           102 
SHYAM         156
HARI          456
JOHN          234
MAC           987
BOB           143
LUSE          NULL

 # RIGHT JOIN:

RIGHT JOIN: RIGHT JOIN is similar to LEFT JOIN. This join returns all the rows of the table on the right side of the join and matching rows for the table on the left side of join. The rows for which there is no matching row on left side, the result-set will contain null. RIGHT JOIN is also known as RIGHT OUTER JOIN.
Syntax:

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
RIGHT JOIN table2
ON table1.matching_column = table2.matching_column;


table1: First table.
table2: Second table
matching_column: Column common to both the tables.

SELECT Student.NAME,StudentCourse.COURSE_ID 
FROM Student
RIGHT JOIN StudentCourse 
ON StudentCourse.ROLL_NO = Student.ROLL_NO;

OUTPUT

NAME        COURSE_ID
RAM           102 
SHYAM         156
HARI          456
JOHN          234
MAC           987
BOB           143
NULL          104

# FULL JOIN:

FULL JOIN: FULL JOIN creates the result-set by combining result of both LEFT JOIN and RIGHT JOIN. The result-set will contain all the rows from both the tables. The rows for which there is no matching, the result-set will contain NULL values.
Syntax:

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
FULL JOIN table2
ON table1.matching_column = table2.matching_column;


table1: First table.
table2: Second table
matching_column: Column common to both the tables.


SELECT Student.NAME,StudentCourse.COURSE_ID 
FROM Student
FULL JOIN StudentCourse 
ON StudentCourse.ROLL_NO = Student.ROLL_NO;


      OUTPUT

NAME        COURSE_ID
RAM           102 
SHYAM         156
HARI          456
JOHN          234
MAC           987
BOB           143
LUSE          NULL
NULL          104